In [34]:
import pandas as pd

In [35]:
df = pd.read_csv("Students.csv")

In [36]:
df

      Name Department Grade  Total_Marks Passed
0    Alice    Science     A         92.0    Yes
1      Bob   Commerce     B         78.0    Yes
2  Charlie    Science     A          NaN    Yes
3    David       Arts     C         65.0     No
4      Eva   Commerce     B         80.0    Yes
5    Frank       Arts     C          NaN     No
6    Grace    Science     A         95.0    Yes
7   Hannah   Commerce     B         88.0    Yes

In [37]:
avg = (df["Total_Marks"].mean())
avg

83.0

In [38]:
df = df.fillna({"Total_Marks":avg})

In [39]:
df

      Name Department Grade  Total_Marks Passed
0    Alice    Science     A         92.0    Yes
1      Bob   Commerce     B         78.0    Yes
2  Charlie    Science     A         83.0    Yes
3    David       Arts     C         65.0     No
4      Eva   Commerce     B         80.0    Yes
5    Frank       Arts     C         83.0     No
6    Grace    Science     A         95.0    Yes
7   Hannah   Commerce     B         88.0    Yes

In [40]:
passing_student = df[(df["Total_Marks"] > 80) & (df["Passed"] == "Yes")]

In [41]:
passing_student

      Name Department Grade  Total_Marks Passed
0    Alice    Science     A         92.0    Yes
2  Charlie    Science     A         83.0    Yes
6    Grace    Science     A         95.0    Yes
7   Hannah   Commerce     B         88.0    Yes

In [42]:
[df.groupby("Department")["Total_Marks"].mean()]

[Department
 Arts        74.0
 Commerce    82.0
 Science     90.0
 Name: Total_Marks, dtype: float64]

In [47]:

df.groupby("Passed")["Passed"].count()

Passed
No     2
Yes    6
Name: Passed, dtype: int64

In [45]:
df
df["Performance"] = df["Total_Marks"].apply(lambda x: "Excellent" if x > 90 else ("Good" if x >= 70 and x <= 90 else "Average "))

In [46]:
df

      Name Department Grade  Total_Marks Passed Performance
0    Alice    Science     A         92.0    Yes   Excellent
1      Bob   Commerce     B         78.0    Yes        Good
2  Charlie    Science     A         83.0    Yes        Good
3    David       Arts     C         65.0     No    Average
4      Eva   Commerce     B         80.0    Yes        Good
5    Frank       Arts     C         83.0     No        Good
6    Grace    Science     A         95.0    Yes   Excellent
7   Hannah   Commerce     B         88.0    Yes        Good